contiki-os/contiki/cc26xxware/inc/hw_ddi.h
                                            // Registers at byte offsets 36 and
                                            // 37
#define DDI_O_MASK16B3839       0x0000024C  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 38 and
                                            // 39
#define DDI_O_MASK16B4041       0x00000250  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 40 and
                                            // 41
#define DDI_O_MASK16B4243       0x00000254  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 42 and
                                            // 43
#define DDI_O_MASK16B4445       0x00000258  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 44 and
                                            // 45
#define DDI_O_MASK16B4647       0x0000025C  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 46 and
                                            // 47
#define DDI_O_MASK16B4849       0x00000260  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 48 and
                                            // 49
#define DDI_O_MASK16B5051       0x00000264  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 50 and
                                            // 51
#define DDI_O_MASK16B5253       0x00000268  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 52 and
                                            // 53
#define DDI_O_MASK16B5455       0x0000026C  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 54 and
                                            // 55
#define DDI_O_MASK16B5657       0x00000270  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 56 and
                                            // 57
#define DDI_O_MASK16B5859       0x00000274  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 58 and
                                            // 59
#define DDI_O_MASK16B6061       0x00000278  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 60 and
                                            // 61
#define DDI_O_MASK16B6263       0x0000027C  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 62 and
                                            // 63


//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_DIR03 register.
//
//*****************************************************************************
#define DDI_DIR03_B3_M          0xFF000000  // Direct access to DDI register 3
#define DDI_DIR03_B3_S          24
#define DDI_DIR03_B2_M          0x00FF0000  // Direct access to DDI register 2
#define DDI_DIR03_B2_S          16
#define DDI_DIR03_B1_M          0x0000FF00  // Direct access to DDI register 1
#define DDI_DIR03_B1_S          8
#define DDI_DIR03_B0_M          0x000000FF  // Direct access to DDI register 0
#define DDI_DIR03_B0_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_DIR47 register.
//
//*****************************************************************************
#define DDI_DIR47_B3_M          0xFF000000  // Direct access to DDI register 7
#define DDI_DIR47_B3_S          24
#define DDI_DIR47_B2_M          0x00FF0000  // Direct access to DDI register 6
#define DDI_DIR47_B2_S          16
#define DDI_DIR47_B1_M          0x0000FF00  // Direct access to DDI register 5
#define DDI_DIR47_B1_S          8
#define DDI_DIR47_B0_M          0x000000FF  // Direct access to DDI register 4
#define DDI_DIR47_B0_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_DIR811 register.
//
//*****************************************************************************
#define DDI_DIR811_B3_M         0xFF000000  // Direct access to DDI register
                                            // 11
#define DDI_DIR811_B3_S         24
#define DDI_DIR811_B2_M         0x00FF0000  // Direct access to DDI register
                                            // 10
#define DDI_DIR811_B2_S         16
#define DDI_DIR811_B1_M         0x0000FF00  // Direct access to DDI register 9
#define DDI_DIR811_B1_S         8
#define DDI_DIR811_B0_M         0x000000FF  // Direct access to DDI register 8
#define DDI_DIR811_B0_S         0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_DIR1215 register.
//
//*****************************************************************************
#define DDI_DIR1215_B3_M        0xFF000000  // Direct access to DDI register
                                            // 15
#define DDI_DIR1215_B3_S        24
#define DDI_DIR1215_B2_M        0x00FF0000  // Direct access to DDI register
                                            // 14
#define DDI_DIR1215_B2_S        16
#define DDI_DIR1215_B1_M        0x0000FF00  // Direct access to DDI register
                                            // 13
#define DDI_DIR1215_B1_S        8
#define DDI_DIR1215_B0_M        0x000000FF  // Direct access to DDI register
                                            // 12
#define DDI_DIR1215_B0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_DIR1619 register.
//
//*****************************************************************************
#define DDI_DIR1619_B3_M        0xFF000000  // Direct access to DDI register
                                            // 19
#define DDI_DIR1619_B3_S        24
#define DDI_DIR1619_B2_M        0x00FF0000  // Direct access to DDI register
                                            // 18
#define DDI_DIR1619_B2_S        16
#define DDI_DIR1619_B1_M        0x0000FF00  // Direct access to DDI register
                                            // 17
#define DDI_DIR1619_B1_S        8
#define DDI_DIR1619_B0_M        0x000000FF  // Direct access to DDI register
                                            // 16
#define DDI_DIR1619_B0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_DIR2023 register.
//
//*****************************************************************************
#define DDI_DIR2023_B3_M        0xFF000000  // Direct access to DDI register
                                            // 23
#define DDI_DIR2023_B3_S        24
#define DDI_DIR2023_B2_M        0x00FF0000  // Direct access to DDI register
                                            // 22
#define DDI_DIR2023_B2_S        16
#define DDI_DIR2023_B1_M        0x0000FF00  // Direct access to DDI register
                                            // 21
#define DDI_DIR2023_B1_S        8
#define DDI_DIR2023_B0_M        0x000000FF  // Direct access to DDI register
                                            // 20
#define DDI_DIR2023_B0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_DIR2427 register.
//
//*****************************************************************************
#define DDI_DIR2427_B3_M        0xFF000000  // Direct access to DDI register
                                            // 27
#define DDI_DIR2427_B3_S        24
#define DDI_DIR2427_B2_M        0x00FF0000  // Direct access to DDI register
                                            // 26
#define DDI_DIR2427_B2_S        16
#define DDI_DIR2427_B1_M        0x0000FF00  // Direct access to DDI register
                                            // 25
#define DDI_DIR2427_B1_S        8
#define DDI_DIR2427_B0_M        0x000000FF  // Direct access to DDI register
                                            // 24
#define DDI_DIR2427_B0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_DIR2831 register.
//
//*****************************************************************************
#define DDI_DIR2831_B3_M        0xFF000000  // Direct access to DDI register
                                            // 31
#define DDI_DIR2831_B3_S        24
#define DDI_DIR2831_B2_M        0x00FF0000  // Direct access to DDI register
                                            // 30
#define DDI_DIR2831_B2_S        16
#define DDI_DIR2831_B1_M        0x0000FF00  // Direct access to DDI register
                                            // 29
#define DDI_DIR2831_B1_S        8
#define DDI_DIR2831_B0_M        0x000000FF  // Direct access to DDI register
                                            // 28
#define DDI_DIR2831_B0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_DIR3235 register.
//
//*****************************************************************************
#define DDI_DIR3235_B3_M        0xFF000000  // Direct access to DDI register
                                            // 35
#define DDI_DIR3235_B3_S        24
#define DDI_DIR3235_B2_M        0x00FF0000  // Direct access to DDI register
                                            // 34
#define DDI_DIR3235_B2_S        16
#define DDI_DIR3235_B1_M        0x0000FF00  // Direct access to DDI register
                                            // 33
#define DDI_DIR3235_B1_S        8
#define DDI_DIR3235_B0_M        0x000000FF  // Direct access to DDI register
                                            // 32
#define DDI_DIR3235_B0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_DIR3639 register.
//
//*****************************************************************************
#define DDI_DIR3639_B3_M        0xFF000000  // Direct access to DDI register
                                            // 39
#define DDI_DIR3639_B3_S        24
#define DDI_DIR3639_B2_M        0x00FF0000  // Direct access to DDI register
                                            // 38
#define DDI_DIR3639_B2_S        16
#define DDI_DIR3639_B1_M        0x0000FF00  // Direct access to DDI register
                                            // 37
#define DDI_DIR3639_B1_S        8
#define DDI_DIR3639_B0_M        0x000000FF  // Direct access to DDI register
                                            // 36
#define DDI_DIR3639_B0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_DIR4043 register.
//
//*****************************************************************************
#define DDI_DIR4043_B3_M        0xFF000000  // Direct access to DDI register
                                            // 43
#define DDI_DIR4043_B3_S        24
#define DDI_DIR4043_B2_M        0x00FF0000  // Direct access to DDI register
                                            // 42
#define DDI_DIR4043_B2_S        16
#define DDI_DIR4043_B1_M        0x0000FF00  // Direct access to DDI register
                                            // 41
#define DDI_DIR4043_B1_S        8
#define DDI_DIR4043_B0_M        0x000000FF  // Direct access to DDI register
                                            // 40
#define DDI_DIR4043_B0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_DIR4447 register.
//
//*****************************************************************************
#define DDI_DIR4447_B3_M        0xFF000000  // Direct access to DDI register
                                            // 47
#define DDI_DIR4447_B3_S        24
#define DDI_DIR4447_B2_M        0x00FF0000  // Direct access to DDI register
                                            // 46
#define DDI_DIR4447_B2_S        16
#define DDI_DIR4447_B1_M        0x0000FF00  // Direct access to DDI register
                                            // 45
#define DDI_DIR4447_B1_S        8
#define DDI_DIR4447_B0_M        0x000000FF  // Direct access to DDI register
                                            // 44
#define DDI_DIR4447_B0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_DIR4851 register.
//
//*****************************************************************************
#define DDI_DIR4851_B3_M        0xFF000000  // Direct access to DDI register
                                            // 51
#define DDI_DIR4851_B3_S        24
#define DDI_DIR4851_B2_M        0x00FF0000  // Direct access to DDI register
                                            // 50
#define DDI_DIR4851_B2_S        16
#define DDI_DIR4851_B1_M        0x0000FF00  // Direct access to DDI register
                                            // 49
#define DDI_DIR4851_B1_S        8
#define DDI_DIR4851_B0_M        0x000000FF  // Direct access to DDI register
                                            // 48
#define DDI_DIR4851_B0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_DIR5255 register.
//
//*****************************************************************************
#define DDI_DIR5255_B3_M        0xFF000000  // Direct access to DDI register
                                            // 55
#define DDI_DIR5255_B3_S        24
#define DDI_DIR5255_B2_M        0x00FF0000  // Direct access to DDI register
                                            // 54
#define DDI_DIR5255_B2_S        16
#define DDI_DIR5255_B1_M        0x0000FF00  // Direct access to DDI register
                                            // 53
#define DDI_DIR5255_B1_S        8
#define DDI_DIR5255_B0_M        0x000000FF  // Direct access to DDI register
                                            // 52
#define DDI_DIR5255_B0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_DIR5659 register.
//
//*****************************************************************************
#define DDI_DIR5659_B3_M        0xFF000000  // Direct access to DDI register
                                            // 59
#define DDI_DIR5659_B3_S        24
#define DDI_DIR5659_B2_M        0x00FF0000  // Direct access to DDI register
                                            // 58
#define DDI_DIR5659_B2_S        16
#define DDI_DIR5659_B1_M        0x0000FF00  // Direct access to DDI register
                                            // 57
#define DDI_DIR5659_B1_S        8
#define DDI_DIR5659_B0_M        0x000000FF  // Direct access to DDI register
                                            // 56
#define DDI_DIR5659_B0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_DIR6063 register.
//
//*****************************************************************************
#define DDI_DIR6063_B3_M        0xFF000000  // Direct access to DDI register
                                            // 63
#define DDI_DIR6063_B3_S        24
#define DDI_DIR6063_B2_M        0x00FF0000  // Direct access to DDI register
                                            // 62
#define DDI_DIR6063_B2_S        16
#define DDI_DIR6063_B1_M        0x0000FF00  // Direct access to DDI register
                                            // 61
#define DDI_DIR6063_B1_S        8
#define DDI_DIR6063_B0_M        0x000000FF  // Direct access to DDI register
                                            // 60
#define DDI_DIR6063_B0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_SET03 register.
//
//*****************************************************************************
#define DDI_SET03_S3_M          0xFF000000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 3. Read returns 0.
#define DDI_SET03_S3_S          24
#define DDI_SET03_S2_M          0x00FF0000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 2. Read returns 0.
#define DDI_SET03_S2_S          16
#define DDI_SET03_S1_M          0x0000FF00  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 1. Read returns 0.
#define DDI_SET03_S1_S          8
#define DDI_SET03_S0_M          0x000000FF  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 0. Read returns 0.
#define DDI_SET03_S0_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_SET47 register.
//
//*****************************************************************************
#define DDI_SET47_S3_M          0xFF000000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 7. Read returns 0.
#define DDI_SET47_S3_S          24
#define DDI_SET47_S2_M          0x00FF0000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 6. Read returns 0.
#define DDI_SET47_S2_S          16
#define DDI_SET47_S1_M          0x0000FF00  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 5. Read returns 0.
#define DDI_SET47_S1_S          8
#define DDI_SET47_S0_M          0x000000FF  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 4. Read returns 0.
#define DDI_SET47_S0_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_SET811 register.
//
//*****************************************************************************
#define DDI_SET811_S3_M         0xFF000000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 11. Read returns 0.
#define DDI_SET811_S3_S         24
#define DDI_SET811_S2_M         0x00FF0000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 10. Read returns 0.
#define DDI_SET811_S2_S         16
#define DDI_SET811_S1_M         0x0000FF00  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 9. Read returns 0.
#define DDI_SET811_S1_S         8
#define DDI_SET811_S0_M         0x000000FF  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 8. Read returns 0.
#define DDI_SET811_S0_S         0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_SET1215 register.
//
//*****************************************************************************
#define DDI_SET1215_S3_M        0xFF000000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 15. Read returns 0.
#define DDI_SET1215_S3_S        24
#define DDI_SET1215_S2_M        0x00FF0000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 14. Read returns 0.
#define DDI_SET1215_S2_S        16
#define DDI_SET1215_S1_M        0x0000FF00  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 13. Read returns 0.
#define DDI_SET1215_S1_S        8
#define DDI_SET1215_S0_M        0x000000FF  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 12. Read returns 0.
#define DDI_SET1215_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_SET1619 register.
//
//*****************************************************************************
#define DDI_SET1619_S3_M        0xFF000000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 19. Read returns 0.
#define DDI_SET1619_S3_S        24
#define DDI_SET1619_S2_M        0x00FF0000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 18. Read returns 0.
#define DDI_SET1619_S2_S        16
#define DDI_SET1619_S1_M        0x0000FF00  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 17. Read returns 0.
#define DDI_SET1619_S1_S        8
#define DDI_SET1619_S0_M        0x000000FF  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 16. Read returns 0.
#define DDI_SET1619_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_SET2023 register.
//
//*****************************************************************************
#define DDI_SET2023_S3_M        0xFF000000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 23. Read returns 0.
#define DDI_SET2023_S3_S        24
#define DDI_SET2023_S2_M        0x00FF0000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 22. Read returns 0.
#define DDI_SET2023_S2_S        16
#define DDI_SET2023_S1_M        0x0000FF00  // A high bit value will set the
                                            // corresponding bit in DDI
