contiki-os/contiki/cc26xxware/inc/hw_ddi.h
                                            // register 12, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B1213_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B1415 register.
//
//*****************************************************************************
#define DDI_MASK4B1415_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 15
#define DDI_MASK4B1415_M1H_S    28
#define DDI_MASK4B1415_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 15, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B1415_D1H_S    24
#define DDI_MASK4B1415_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 15
#define DDI_MASK4B1415_M1L_S    20
#define DDI_MASK4B1415_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 15, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B1415_D1L_S    16
#define DDI_MASK4B1415_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 14
#define DDI_MASK4B1415_M0H_S    12
#define DDI_MASK4B1415_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 14, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B1415_D0H_S    8
#define DDI_MASK4B1415_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 14
#define DDI_MASK4B1415_M0L_S    4
#define DDI_MASK4B1415_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 14, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B1415_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B1617 register.
//
//*****************************************************************************
#define DDI_MASK4B1617_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 17
#define DDI_MASK4B1617_M1H_S    28
#define DDI_MASK4B1617_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 17, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B1617_D1H_S    24
#define DDI_MASK4B1617_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 17
#define DDI_MASK4B1617_M1L_S    20
#define DDI_MASK4B1617_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 17, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B1617_D1L_S    16
#define DDI_MASK4B1617_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 16
#define DDI_MASK4B1617_M0H_S    12
#define DDI_MASK4B1617_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 16, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B1617_D0H_S    8
#define DDI_MASK4B1617_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 16
#define DDI_MASK4B1617_M0L_S    4
#define DDI_MASK4B1617_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 16, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B1617_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B1819 register.
//
//*****************************************************************************
#define DDI_MASK4B1819_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 19
#define DDI_MASK4B1819_M1H_S    28
#define DDI_MASK4B1819_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 19, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B1819_D1H_S    24
#define DDI_MASK4B1819_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 19
#define DDI_MASK4B1819_M1L_S    20
#define DDI_MASK4B1819_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 19, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B1819_D1L_S    16
#define DDI_MASK4B1819_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 18
#define DDI_MASK4B1819_M0H_S    12
#define DDI_MASK4B1819_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 18, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B1819_D0H_S    8
#define DDI_MASK4B1819_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 18
#define DDI_MASK4B1819_M0L_S    4
#define DDI_MASK4B1819_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 18, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B1819_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B2021 register.
//
//*****************************************************************************
#define DDI_MASK4B2021_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 21
#define DDI_MASK4B2021_M1H_S    28
#define DDI_MASK4B2021_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 21, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B2021_D1H_S    24
#define DDI_MASK4B2021_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 21
#define DDI_MASK4B2021_M1L_S    20
#define DDI_MASK4B2021_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 21, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B2021_D1L_S    16
#define DDI_MASK4B2021_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 20
#define DDI_MASK4B2021_M0H_S    12
#define DDI_MASK4B2021_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 20, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B2021_D0H_S    8
#define DDI_MASK4B2021_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 20
#define DDI_MASK4B2021_M0L_S    4
#define DDI_MASK4B2021_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 20, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B2021_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B2223 register.
//
//*****************************************************************************
#define DDI_MASK4B2223_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 23
#define DDI_MASK4B2223_M1H_S    28
#define DDI_MASK4B2223_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 23, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B2223_D1H_S    24
#define DDI_MASK4B2223_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 23
#define DDI_MASK4B2223_M1L_S    20
#define DDI_MASK4B2223_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 23, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B2223_D1L_S    16
#define DDI_MASK4B2223_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 22
#define DDI_MASK4B2223_M0H_S    12
#define DDI_MASK4B2223_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 22, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B2223_D0H_S    8
#define DDI_MASK4B2223_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 22
#define DDI_MASK4B2223_M0L_S    4
#define DDI_MASK4B2223_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 22, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B2223_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B2425 register.
//
//*****************************************************************************
#define DDI_MASK4B2425_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 25
#define DDI_MASK4B2425_M1H_S    28
#define DDI_MASK4B2425_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 25, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B2425_D1H_S    24
#define DDI_MASK4B2425_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 25
#define DDI_MASK4B2425_M1L_S    20
#define DDI_MASK4B2425_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 25, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B2425_D1L_S    16
#define DDI_MASK4B2425_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 24
#define DDI_MASK4B2425_M0H_S    12
#define DDI_MASK4B2425_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 24, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B2425_D0H_S    8
#define DDI_MASK4B2425_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 24
#define DDI_MASK4B2425_M0L_S    4
#define DDI_MASK4B2425_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 24, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B2425_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B2627 register.
//
//*****************************************************************************
#define DDI_MASK4B2627_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 27
#define DDI_MASK4B2627_M1H_S    28
#define DDI_MASK4B2627_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 27, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B2627_D1H_S    24
#define DDI_MASK4B2627_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 27
#define DDI_MASK4B2627_M1L_S    20
#define DDI_MASK4B2627_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 27, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B2627_D1L_S    16
#define DDI_MASK4B2627_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 26
#define DDI_MASK4B2627_M0H_S    12
#define DDI_MASK4B2627_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 26, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B2627_D0H_S    8
#define DDI_MASK4B2627_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 26
#define DDI_MASK4B2627_M0L_S    4
#define DDI_MASK4B2627_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 26, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B2627_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B2829 register.
//
//*****************************************************************************
#define DDI_MASK4B2829_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 29
#define DDI_MASK4B2829_M1H_S    28
#define DDI_MASK4B2829_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 29, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B2829_D1H_S    24
#define DDI_MASK4B2829_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 29
#define DDI_MASK4B2829_M1L_S    20
#define DDI_MASK4B2829_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 29, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B2829_D1L_S    16
#define DDI_MASK4B2829_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 28
#define DDI_MASK4B2829_M0H_S    12
#define DDI_MASK4B2829_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 28, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B2829_D0H_S    8
#define DDI_MASK4B2829_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 28
#define DDI_MASK4B2829_M0L_S    4
#define DDI_MASK4B2829_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 28, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B2829_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B3031 register.
//
//*****************************************************************************
#define DDI_MASK4B3031_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 31
#define DDI_MASK4B3031_M1H_S    28
#define DDI_MASK4B3031_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 31, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B3031_D1H_S    24
#define DDI_MASK4B3031_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 31
#define DDI_MASK4B3031_M1L_S    20
#define DDI_MASK4B3031_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 31, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B3031_D1L_S    16
#define DDI_MASK4B3031_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 30
#define DDI_MASK4B3031_M0H_S    12
#define DDI_MASK4B3031_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 30, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B3031_D0H_S    8
#define DDI_MASK4B3031_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 30
#define DDI_MASK4B3031_M0L_S    4
#define DDI_MASK4B3031_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 30, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B3031_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B3233 register.
//
//*****************************************************************************
#define DDI_MASK4B3233_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 33
#define DDI_MASK4B3233_M1H_S    28
#define DDI_MASK4B3233_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 33, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B3233_D1H_S    24
#define DDI_MASK4B3233_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 33
#define DDI_MASK4B3233_M1L_S    20
#define DDI_MASK4B3233_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 33, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B3233_D1L_S    16
#define DDI_MASK4B3233_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 32
#define DDI_MASK4B3233_M0H_S    12
#define DDI_MASK4B3233_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 32, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B3233_D0H_S    8
#define DDI_MASK4B3233_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 32
#define DDI_MASK4B3233_M0L_S    4
#define DDI_MASK4B3233_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 32, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B3233_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B3435 register.
//
//*****************************************************************************
#define DDI_MASK4B3435_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 35
#define DDI_MASK4B3435_M1H_S    28
#define DDI_MASK4B3435_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 35, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B3435_D1H_S    24
#define DDI_MASK4B3435_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 35
#define DDI_MASK4B3435_M1L_S    20
#define DDI_MASK4B3435_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 35, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B3435_D1L_S    16
#define DDI_MASK4B3435_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 34
#define DDI_MASK4B3435_M0H_S    12
#define DDI_MASK4B3435_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 34, - only bits
                                            // selected by mask M0H will be
